tutorial/app/controllers/comments_controller.rb

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "topic_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "Kevin"], ["body", "YEEET"], ["topic_id", 1], ["created_at", "2018-01-27 08:32:28.381164"], ["updated_at", "2018-01-27 08:32:28.381164"]]
---
 def create
    @topic = Topic.find(params[:topic_id])
    @comment = @topic.comments.create(comment_params)

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."topic_id" = ? AND "comments"."id" = ? LIMIT ?  [["topic_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
---
  def destroy
    @topic = Topic.find(params[:topic_id])
    @comment = @topic.comments.find(params[:id])
    @comment.destroy