tutorial/app/controllers/topics_controller.rb

  def create
    @topic = Topic.new(topic_params)

    if @topic.save
---
INSERT INTO "topics" ("title", "created_at", "updated_at", "description") VALUES (?, ?, ?, ?)  [["title", "asdasd"], ["created_at", "2018-01-27 07:03:58.372163"], ["updated_at", "2018-01-27 07:03:58.372163"], ["description", "awewewe"]]

  def destroy
    @topic = Topic.find(params[:id])
    @topic.destroy
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "topics" WHERE "topics"."id" = ?  [["id", 1]]